#Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#Пример:

#- [2, 3, 4, 5, 6] => [12, 15, 16];
#- [2, 3, 5, 6] => [12, 15]
spisok = [2, 3, 4, 5, 6, 5, 9]
i = 0
j = -1
summa = 0
for i in range(round(len(spisok)/2)):
    summa += spisok[i] * spisok[j]
    print(summa)
    summa = 0
    j += -1
print('Molodez')