# Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов исходной последовательности.
array = [2, 8, 8, 4, 9, 15, 14, 4, 15, 14]
print(array)
array2 = list(set(array))
print(array2)